CSI API ETABS v1

# cSapModelFunc Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cFunction Func { get; }

    ReadOnly Property Func As cFunction
    	Get

    Dim instance As cSapModel
    Dim value As cFunction

    value = instance.Func

    property cFunction^ Func {
    	cFunction^ get ();
    }

    abstract Func : cFunction with get

#### Property Value

Type: cFunction

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com